2017-03-15-interoperable-100G-dwdm-equipment.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="UTF-8">
<link rel="alternate"
      type="application/rss+xml"
      href="https://plajjan.github.io/rss.xml"
      title="RSS feed for https://plajjan.github.io/"/>
<title>Interoperable 100G DWDM equipment</title>
<meta name="author" content="Kristian Larsson">
<meta name="referrer" content="no-referrer">
<link href= "css/style.css" rel="stylesheet" type="text/css" />
<link rel="icon" href="static/favicon.ico"></head>
<body>
<div id="preamble" class="status">
<div class='header'>
  <a href='/'>Network Automation ramblings by Kristian Larsson</a>
</div>
<nav style='float: right; display: block;'>
<a href='/'>Blog</a>
<a href='/tools.html'>Tools</a>
<a href='/about.html'>About</a>
</nav></div>
<div id="content">
<div class="post-date">15 Mar 2017</div><h1 class="post-title"><a href="2017-03-15-interoperable-100G-dwdm-equipment.html">Interoperable 100G DWDM equipment</a></h1>

<div id="outline-container-orgcbb1e4e" class="outline-2">
<h2 id="orgcbb1e4e"><span class="section-number-2">1</span> Interoperable coherent 100G DWDM</h2>
<div class="outline-text-2" id="text-1">
<p>
This is a non-comprehensive list of interoperable coherent 100G DWDM equipment.
</p>

<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Vendor</th>
<th scope="col" class="org-left">Model</th>
<th scope="col" class="org-left">Description</th>
<th scope="col" class="org-left">Tested</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Juniper</td>
<td class="org-left">MIC3-100G-DWDM</td>
<td class="org-left">1x100GE IPoDWDM line card for MX</td>
<td class="org-left">TS</td>
</tr>
</tbody>
</table>
</div>
</div>


<div id="outline-container-org2330904" class="outline-2">
<h2 id="org2330904"><span class="section-number-2">2</span> Coherent 100G DWDM without interop</h2>
<div class="outline-text-2" id="text-2">
<p>
This is a non-comprehensive list of equipment that supports coherent 100G DWDM but does <b><b>NOT</b></b> support standardised FEC and mapping:
</p>

<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Vendor</th>
<th scope="col" class="org-left">Model</th>
<th scope="col" class="org-left">Description</th>
<th scope="col" class="org-left">Tested</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Juniper</td>
<td class="org-left">P1-PTX-2-100G-WDM</td>
<td class="org-left">2x100G IPoDWDM module for PTX</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Juniper</td>
<td class="org-left">PTX-5-100G-WDM</td>
<td class="org-left">5x100G IPoDWDM module for PTX</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>
<div class="taglist"><a href="tags.html">Tags</a>: <a href="tag-terastream,.html">TeraStream,</a> <a href="tag-100g.html">100G</a> <a href="tag-dwdm.html">DWDM</a> </div></div>
<div id="postamble" class="status"><br/><div id="archive">
  <a href="/archive.html">Other posts</a>
</div></div>
</body>
</html>
